app/controllers/posts_controller.rb

	def show
		id = params[:id]
		@post = Post.find(id)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 32], ["LIMIT", 1]]